mariusmm/CMSIS_Drivers/EFM32/CMSIS_Driver/Driver_USART.c
/*
 * Copyright (c) 2020 Màrius Montón <marius.monton@gmail.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Project:   CMSIS Driver implementation for EFM32 devices
 *
 * This library manages USARTs and LEUARTs for EFM32 devices.
 * The example is using USART1 in LOCATION #1 and LEUART0 in LOCATION #0
 * (compatible with "Starter Kit EFM32TG-STK3300") pins EXP-4, EXP-6 and EXP-12,
 * EXP-14,
 *
 * - Implemented non-blocking mode for Send, Receive functions
 * - Implemented ARM_USART_GetModemStatus function
 *
 * TODO: Implement transfer function
 * TODO: Implement the use of DMA for Send, Receive and Transfer functions.
 * TODO: Implement ARM_USART_GetStatus function.
 * TODO: Implement ARM_USART_SetModemControl function
 *
 */

#include "Driver_USART.h"

#include "em_device.h"
#include "em_cmu.h"
#include "em_usart.h"
#include "em_leuart.h"
#include "em_dma.h"

#define ARM_USART_DRV_VERSION    ARM_DRIVER_VERSION_MAJOR_MINOR(1, 0)   /* driver version */

/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion = {
    ARM_USART_API_VERSION,
    ARM_USART_DRV_VERSION
};

typedef struct {
    GPIO_Port_TypeDef port;
    unsigned int pin;
} EFM32_PIN;

typedef struct {
    void *TxBuf;                /* Pointer to Tx buffer */
    void *RxBuf;                /* Pointer to Rx Buffer */
    uint32_t TxNum;             /* Items to send */
    uint32_t RxNum;             /* Items to receive */
    uint32_t TxCnt;             /* Items sent */
    uint32_t RxCnt;             /* Items received */
} USART_TRANSFER_INFO;

typedef struct {
    ARM_USART_CAPABILITIES capabilities;        // Capabilities
    /* Specific EFM32 UART properties */
    void *device;
    USART_InitAsync_TypeDef usart_cfg;
    uint32_t LOCATION;
    EFM32_PIN TxPin;
    EFM32_PIN RxPin;
    USART_TRANSFER_INFO xfer;
    ARM_USART_STATUS status;
    ARM_USART_MODEM_STATUS modem_status;
    ARM_USART_SignalEvent_t cb_event;
} EFM32_USART_RESOURCES;

/* Driver Capabilities */
#ifdef USART0
static EFM32_USART_RESOURCES USART0_Resources = {
    {
     1,                         /* supports UART (Asynchronous) mode */
     0,                         /* supports Synchronous Master mode */
     0,                         /* supports Synchronous Slave mode */
     0,                         /* supports UART Single-wire mode */
     0,                         /* supports UART IrDA mode */
     0,                         /* supports UART Smart Card mode */
     0,                         /* Smart Card Clock generator available */
     0,                         /* RTS Flow Control available */
     0,                         /* CTS Flow Control available */
     0,                         /* Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE */
     0,                         /* Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT */
     0,                         /* RTS Line: 0=not available, 1=available */
     0,                         /* CTS Line: 0=not available, 1=available */
     0,                         /* DTR Line: 0=not available, 1=available */
     0,                         /* DSR Line: 0=not available, 1=available */
     0,                         /* DCD Line: 0=not available, 1=available */
     0,                         /* RI Line: 0=not available, 1=available */
     0,                         /* Signal CTS change event: \ref ARM_USART_EVENT_CTS */
     0,                         /* Signal DSR change event: \ref ARM_USART_EVENT_DSR */
     0,                         /* Signal DCD change event: \ref ARM_USART_EVENT_DCD */
     0,                         /* Signal RI change event: \ref ARM_USART_EVENT_RI */
     0
     /* Reserved (must be zero) */
     },
    USART0,
    USART_INITASYNC_DEFAULT,
    USART_ROUTE_LOCATION_LOC1,  /* Location */
    {gpioPortD, 0},
    {gpioPortD, 1},
    {
     NULL, NULL,
     0, 0, 0, 0,
     },
    {0},
    {0},
    NULL,
};
#endif

#ifdef USART1
static EFM32_USART_RESOURCES USART1_Resources = {
    {
     1,                         /* supports UART (Asynchronous) mode */
     0,                         /* supports Synchronous Master mode */
     0,                         /* supports Synchronous Slave mode */
     0,                         /* supports UART Single-wire mode */
     0,                         /* supports UART IrDA mode */
     0,                         /* supports UART Smart Card mode */
     0,                         /* Smart Card Clock generator available */
     0,                         /* RTS Flow Control available */
     0,                         /* CTS Flow Control available */
     0,                         /* Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE */
     0,                         /* Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT */
     0,                         /* RTS Line: 0=not available, 1=available */
     0,                         /* CTS Line: 0=not available, 1=available */
     0,                         /* DTR Line: 0=not available, 1=available */
     0,                         /* DSR Line: 0=not available, 1=available */
     0,                         /* DCD Line: 0=not available, 1=available */
     0,                         /* RI Line: 0=not available, 1=available */
     0,                         /* Signal CTS change event: \ref ARM_USART_EVENT_CTS */
     0,                         /* Signal DSR change event: \ref ARM_USART_EVENT_DSR */
     0,                         /* Signal DCD change event: \ref ARM_USART_EVENT_DCD */
     0,                         /* Signal RI change event: \ref ARM_USART_EVENT_RI */
     0
     /* Reserved (must be zero) */
     },
    USART1,
    USART_INITASYNC_DEFAULT,
    USART_ROUTE_LOCATION_LOC1,  /* Location */
    {gpioPortD, 0},
    {gpioPortD, 1},
    {
     NULL, NULL,
     0, 0, 0, 0,
     },
    {0},
    {0},
    NULL,
};
#endif
#ifdef USART2
static EFM32_USART_RESOURCES USART2_Resources = {
    {
     1,                         /* supports UART (Asynchronous) mode */
     0,                         /* supports Synchronous Master mode */
     0,                         /* supports Synchronous Slave mode */
     0,                         /* supports UART Single-wire mode */
     0,                         /* supports UART IrDA mode */
     0,                         /* supports UART Smart Card mode */
     0,                         /* Smart Card Clock generator available */
     0,                         /* RTS Flow Control available */
     0,                         /* CTS Flow Control available */
     0,                         /* Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE */
     0,                         /* Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT */
     0,                         /* RTS Line: 0=not available, 1=available */
     0,                         /* CTS Line: 0=not available, 1=available */
     0,                         /* DTR Line: 0=not available, 1=available */
     0,                         /* DSR Line: 0=not available, 1=available */
     0,                         /* DCD Line: 0=not available, 1=available */
     0,                         /* RI Line: 0=not available, 1=available */
     0,                         /* Signal CTS change event: \ref ARM_USART_EVENT_CTS */
     0,                         /* Signal DSR change event: \ref ARM_USART_EVENT_DSR */
     0,                         /* Signal DCD change event: \ref ARM_USART_EVENT_DCD */
     0,                         /* Signal RI change event: \ref ARM_USART_EVENT_RI */
     0
     /* Reserved (must be zero) */
     },
    USART2,
    USART_INITASYNC_DEFAULT,
    USART_ROUTE_LOCATION_LOC1,  /* Location */
    {gpioPortD, 0},
    {gpioPortD, 1},
    {
     NULL, NULL,
     0, 0, 0, 0,
     },
    {0},
    {0},
    NULL,
};
#endif
#ifdef USART3
static EFM32_USART_RESOURCES USART3_Resources = {
    {
     1,                         /* supports UART (Asynchronous) mode */
     0,                         /* supports Synchronous Master mode */
     0,                         /* supports Synchronous Slave mode */
     0,                         /* supports UART Single-wire mode */
     0,                         /* supports UART IrDA mode */
     0,                         /* supports UART Smart Card mode */
     0,                         /* Smart Card Clock generator available */
     0,                         /* RTS Flow Control available */
     0,                         /* CTS Flow Control available */
     0,                         /* Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE */
     0,                         /* Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT */
     0,                         /* RTS Line: 0=not available, 1=available */
     0,                         /* CTS Line: 0=not available, 1=available */
     0,                         /* DTR Line: 0=not available, 1=available */
     0,                         /* DSR Line: 0=not available, 1=available */
     0,                         /* DCD Line: 0=not available, 1=available */
     0,                         /* RI Line: 0=not available, 1=available */
     0,                         /* Signal CTS change event: \ref ARM_USART_EVENT_CTS */
     0,                         /* Signal DSR change event: \ref ARM_USART_EVENT_DSR */
     0,                         /* Signal DCD change event: \ref ARM_USART_EVENT_DCD */
     0,                         /* Signal RI change event: \ref ARM_USART_EVENT_RI */
     0
     /* Reserved (must be zero) */
     },
    USART3,
    USART_INITASYNC_DEFAULT,
    USART_ROUTE_LOCATION_LOC1,  /* Location */
    {gpioPortD, 0},
    {gpioPortD, 1},
    {
     NULL, NULL,
     0, 0, 0, 0,
     },
    {0},
    {0},
    NULL,
};
#endif

#ifdef LEUART0
static EFM32_USART_RESOURCES LEUART0_Resources = {
    {
     1,                         /* supports UART (Asynchronous) mode */
     0,                         /* supports Synchronous Master mode */
     0,                         /* supports Synchronous Slave mode */
     0,                         /* supports UART Single-wire mode */
     0,                         /* supports UART IrDA mode */
     0,                         /* supports UART Smart Card mode */
     0,                         /* Smart Card Clock generator available */
     0,                         /* RTS Flow Control available */
     0,                         /* CTS Flow Control available */
     0,                         /* Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE */
     0,                         /* Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT */
     0,                         /* RTS Line: 0=not available, 1=available */
     0,                         /* CTS Line: 0=not available, 1=available */
     0,                         /* DTR Line: 0=not available, 1=available */
     0,                         /* DSR Line: 0=not available, 1=available */
     0,                         /* DCD Line: 0=not available, 1=available */
     0,                         /* RI Line: 0=not available, 1=available */
     0,                         /* Signal CTS change event: \ref ARM_USART_EVENT_CTS */
     0,                         /* Signal DSR change event: \ref ARM_USART_EVENT_DSR */
     0,                         /* Signal DCD change event: \ref ARM_USART_EVENT_DCD */
     0,                         /* Signal RI change event: \ref ARM_USART_EVENT_RI */
     0
     /* Reserved (must be zero) */
     },
    LEUART0,
    LEUART_INIT_DEFAULT,
    LEUART_ROUTE_LOCATION_LOC0, /* Location */
    {gpioPortD, 4},             // Tx
    {gpioPortD, 5},             // Rx
    {
     NULL, NULL,
     0, 0, 0, 0,
     },
    {0},
    {0},
    NULL,
};
#endif
#ifdef LEUART1
static EFM32_USART_RESOURCES LEUART1_Resources = {
    {
     1,                         /* supports UART (Asynchronous) mode */
     0,                         /* supports Synchronous Master mode */
     0,                         /* supports Synchronous Slave mode */
     0,                         /* supports UART Single-wire mode */
     0,                         /* supports UART IrDA mode */
     0,                         /* supports UART Smart Card mode */
     0,                         /* Smart Card Clock generator available */
     0,                         /* RTS Flow Control available */
     0,                         /* CTS Flow Control available */
     0,                         /* Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE */
     0,                         /* Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT */
     0,                         /* RTS Line: 0=not available, 1=available */
     0,                         /* CTS Line: 0=not available, 1=available */
     0,                         /* DTR Line: 0=not available, 1=available */
     0,                         /* DSR Line: 0=not available, 1=available */
     0,                         /* DCD Line: 0=not available, 1=available */
     0,                         /* RI Line: 0=not available, 1=available */
     0,                         /* Signal CTS change event: \ref ARM_USART_EVENT_CTS */
     0,                         /* Signal DSR change event: \ref ARM_USART_EVENT_DSR */
     0,                         /* Signal DCD change event: \ref ARM_USART_EVENT_DCD */
     0,                         /* Signal RI change event: \ref ARM_USART_EVENT_RI */
     0
     /* Reserved (must be zero) */
     },
    LEUART1,
    LEUART_INIT_DEFAULT,
    LEUART_ROUTE_LOCATION_LOC0, /* Location */
    {gpioPortD, 4},             // Tx
    {gpioPortD, 5},             // Rx
    {
     NULL, NULL,
     0, 0, 0, 0,
     },
    {0},
    {0},
    NULL,
};
#endif

