mariusmm/CMSIS_Drivers/EFM32/CMSIS_Driver/Driver_USART.c
// EFM32 functions
static int32_t EFM32_USART_Initialize(ARM_USART_SignalEvent_t cb_event, EFM32_USART_RESOURCES * usart)
{
    CMU_ClockEnable(cmuClock_GPIO, true);
    GPIO_PinModeSet(usart->TxPin.port, usart->TxPin.pin, gpioModePushPull, 1);  /* TX Pin */
    GPIO_PinModeSet(usart->RxPin.port, usart->RxPin.pin, gpioModeInputPull, 1); /* RX Pin */

    /* Baudrate set to CMSIS default value */
    usart->usart_cfg.baudrate = 9600;

#ifdef USART0
    if (usart->device == USART0) {
        CMU_ClockEnable(cmuClock_USART0, true);

        USART_IntEnable(USART0, USART_IEN_TXC);

        NVIC_ClearPendingIRQ(USART0_TX_IRQn);
        NVIC_EnableIRQ(USART0_TX_IRQn);
    }
#endif
#ifdef USART1
    if (usart->device == USART1) {
        CMU_ClockEnable(cmuClock_USART1, true);

        USART_IntEnable(USART1, USART_IEN_TXC);

        NVIC_ClearPendingIRQ(USART1_TX_IRQn);
        NVIC_EnableIRQ(USART1_TX_IRQn);
    }
#endif
#ifdef USART2
    if (usart->device == USART2) {
        CMU_ClockEnable(cmuClock_USART2, true);

        USART_IntEnable(USART2, USART_IEN_TXC);

        NVIC_ClearPendingIRQ(USART2_TX_IRQn);
        NVIC_EnableIRQ(USART2_TX_IRQn);
    }
#endif
#ifdef USART3
    if (usart->device == USART3) {
        CMU_ClockEnable(cmuClock_USART3, true);

        USART_IntEnable(USART3, USART_IEN_TXC);

        NVIC_ClearPendingIRQ(USART3_TX_IRQn);
        NVIC_EnableIRQ(USART3_TX_IRQn);
    }
#endif

    usart->xfer.TxCnt = 0;
    usart->xfer.RxCnt = 0;

    if (cb_event != NULL) {
        usart->cb_event = cb_event;
    }

    return ARM_DRIVER_OK;
}

static int32_t EFM32_LEUART_Initialize(ARM_USART_SignalEvent_t cb_event, EFM32_USART_RESOURCES * usart)
{
    CMU_ClockEnable(cmuClock_GPIO, true);
    CMU_ClockEnable(cmuClock_CORELE, true);

    GPIO_PinModeSet(usart->TxPin.port, usart->TxPin.pin, gpioModePushPull, 1);  /* TX Pin */
    GPIO_PinModeSet(usart->RxPin.port, usart->RxPin.pin, gpioModeInputPull, 1); /* RX Pin */

#ifdef LEUART0
    if (usart->device == LEUART0) {
        CMU_ClockEnable(cmuClock_LEUART0, true);
        LEUART_IntEnable(LEUART0, LEUART_IEN_TXC);
        NVIC_ClearPendingIRQ(LEUART0_IRQn);
        NVIC_EnableIRQ(LEUART0_IRQn);
    }
#endif
#ifdef LEUART1
    if (usart->device == LEUART1) {
        CMU_ClockEnable(cmuClock_LEUART1, true);
        LEUART_IntEnable(LEUART1, LEUART_IEN_TXC);
        NVIC_ClearPendingIRQ(LEUART1_IRQn);
        NVIC_EnableIRQ(LEUART1_IRQn);
    }
#endif

    usart->xfer.TxCnt = 0;
    usart->xfer.RxCnt = 0;

    if (cb_event != NULL) {
        usart->cb_event = cb_event;
    }

    return ARM_DRIVER_OK;
}

static int32_t EFM32_USART_Uninitialize(EFM32_USART_RESOURCES * usart)
{
#ifdef USART0
    if (usart->device == USART0) {
        CMU_ClockEnable(cmuClock_USART0, false);
        NVIC_DisableIRQ(USART0_TX_IRQn);
    }
#endif
#ifdef USART1
    if (usart->device == USART1) {
        CMU_ClockEnable(cmuClock_USART1, false);
        NVIC_DisableIRQ(USART1_TX_IRQn);
    }
#endif
#ifdef USART2
    if (usart->device == USART2) {
        CMU_ClockEnable(cmuClock_USART2, false);
        NVIC_DisableIRQ(USART2_TX_IRQn);
    }
#endif
#ifdef USART3
    if (usart->device == USART3) {
        CMU_ClockEnable(cmuClock_USART3, false);
        NVIC_DisableIRQ(USART3_TX_IRQn);
    }
#endif

    GPIO_PinModeSet(usart->TxPin.port, usart->TxPin.pin, gpioModeDisabled, 1);  /* TX Pin */
    GPIO_PinModeSet(usart->RxPin.port, usart->RxPin.pin, gpioModeDisabled, 1);  /* RX Pin */

    usart->cb_event = NULL;

    return ARM_DRIVER_OK;
}

static int32_t EFM32_LEUART_Uninitialize(EFM32_USART_RESOURCES * usart)
{
#ifdef LEUART0
    if (usart->device == LEUART0) {
        CMU_ClockEnable(cmuClock_LEUART0, false);
        NVIC_DisableIRQ(LEUART0_IRQn);
    }
#endif
#ifdef LEUART1
    if (usart->device == LEUART1) {
        CMU_ClockEnable(cmuClock_LEUART1, false);
        NVIC_DisableIRQ(LEUART1_IRQn);
    }
#endif

    GPIO_PinModeSet(usart->TxPin.port, usart->TxPin.pin, gpioModeDisabled, 1);  /* TX Pin */
    GPIO_PinModeSet(usart->RxPin.port, usart->RxPin.pin, gpioModeDisabled, 1);  /* RX Pin */

    usart->cb_event = NULL;

    return ARM_DRIVER_OK;
}

static int32_t EFM32_USART_PowerControl(ARM_POWER_STATE state, EFM32_USART_RESOURCES const *usart)
{
    if (usart->device == NULL) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (state) {
    case ARM_POWER_OFF:
        USART_IntDisable(usart->device, USART_IEN_TXC);
        USART_Enable(usart->device, false);
        break;
    case ARM_POWER_LOW:
        return ARM_DRIVER_ERROR_UNSUPPORTED;
        break;
    case ARM_POWER_FULL:
        /* Enable TX Complete IRQ */
        USART_IntEnable(usart->device, USART_IEN_TXC);
        USART_Enable(usart->device, true);
        break;
    }

    return ARM_DRIVER_OK;
}

static int32_t EFM32_LEUART_PowerControl(ARM_POWER_STATE state, EFM32_USART_RESOURCES const *usart)
{
    if (usart->device == NULL) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (state) {
    case ARM_POWER_OFF:
        LEUART_IntDisable(usart->device, LEUART_IEN_TXC);
        LEUART_Enable(usart->device, false);
        break;
    case ARM_POWER_LOW:
        return ARM_DRIVER_ERROR_UNSUPPORTED;
        break;
    case ARM_POWER_FULL:
        LEUART_IntEnable(usart->device, LEUART_IEN_TXC);
        LEUART_Enable(usart->device, true);
        break;
    }

    return ARM_DRIVER_OK;
}

static int32_t EFM32_USART_Send(const void *data, uint32_t num, EFM32_USART_RESOURCES * usart)
{
    if (usart->device == NULL) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if ((data == NULL) || (num == 0U)) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    // Using interrupts
    char *aux = (char *)data;
    usart->xfer.TxBuf = (void *)data;
    usart->xfer.TxNum = num;
    usart->xfer.TxCnt = 0;
    USART_Tx(usart->device, *aux);      // This will trigger the TX Done IRQ

    return ARM_DRIVER_OK;
}

static int32_t EFM32_LEUART_Send(const void *data, uint32_t num, EFM32_USART_RESOURCES * usart)
{
    if (usart->device == NULL) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

