mariusmm/CMSIS_Drivers/EFM32/CMSIS_Driver/Driver_USART.c
    if ((data == NULL) || (num == 0U)) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    // Using interrupts
    char *aux = (char *)data;
    usart->xfer.TxBuf = (void *)data;
    usart->xfer.TxNum = num;
    usart->xfer.TxCnt = 0;
    LEUART_Tx(usart->device, *aux++);

    return ARM_DRIVER_OK;
}

static int32_t EFM32_USART_Receive(const void *data, uint32_t num, EFM32_USART_RESOURCES * usart)
{
    if (usart->device == NULL) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if ((data == NULL) || (num == 0U)) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if (usart->status.rx_busy == true) {
        return ARM_DRIVER_ERROR_BUSY;
    }

    // Use interrupts
    usart->xfer.RxBuf = (void *)data;
    usart->xfer.RxNum = num;
    usart->xfer.RxCnt = 0;
    usart->status.rx_busy = true;
    USART_IntEnable(usart->device, USART_IEN_RXDATAV);

#ifdef USART0
    if (usart->device == USART0) {
        NVIC_EnableIRQ(USART0_RX_IRQn);
    }
#endif
#ifdef USART1
    if (usart->device == USART1) {
        NVIC_EnableIRQ(USART1_RX_IRQn);
    }
#endif
#ifdef USART2
    if (usart->device == USART2) {
        NVIC_EnableIRQ(USART2_RX_IRQn);
    }
#endif
#ifdef USART3
    if (usart->device == USART3) {
        NVIC_EnableIRQ(USART3_RX_IRQn);
    }
#endif

    return ARM_DRIVER_OK;
}

static int32_t EFM32_LEUART_Receive(const void *data, uint32_t num, EFM32_USART_RESOURCES * usart)
{
    if (usart->device == NULL) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if ((data == NULL) || (num == 0U)) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if (usart->status.rx_busy == true) {
        return ARM_DRIVER_ERROR_BUSY;
    }

    // Use interrupts
    usart->xfer.RxBuf = (void *)data;
    usart->xfer.RxNum = num;
    usart->xfer.RxCnt = 0;
    usart->status.rx_busy = true;
    LEUART_IntEnable(usart->device, LEUART_IEN_RXDATAV);

#ifdef LEUART0
    if (usart->device == LEUART0) {
        NVIC_EnableIRQ(LEUART0_IRQn);
    }
#endif
#ifdef LEUART1
    if (usart->device == LEUART1) {
        NVIC_EnableIRQ(LEUART1_IRQn);
    }
#endif

    return ARM_DRIVER_OK;
}

static int32_t EFM32_USART_Transfer(const void *data_out, void *data_in,
                                    uint32_t num, EFM32_USART_RESOURCES const *usart)
{
    return ARM_DRIVER_ERROR_UNSUPPORTED;
}

static int32_t EFM32_LEUART_Transfer(const void *data_out, void *data_in,
                                     uint32_t num, EFM32_USART_RESOURCES const *usart)
{
    return ARM_DRIVER_ERROR_UNSUPPORTED;
}

static uint32_t EFM32_USART_GetTxCount(EFM32_USART_RESOURCES const *usart)
{
    return usart->xfer.TxCnt;
}

static uint32_t EFM32_LEUART_GetTxCount(EFM32_USART_RESOURCES const *usart)
{
    return usart->xfer.TxCnt;
}

static uint32_t EFM32_USART_GetRxCount(EFM32_USART_RESOURCES const *usart)
{
    return usart->xfer.RxCnt;
}

static uint32_t EFM32_LEUART_GetRxCount(EFM32_USART_RESOURCES const *usart)
{
    return usart->xfer.RxCnt;
}

static int32_t EFM32_USART_Control(uint32_t control, uint32_t arg, EFM32_USART_RESOURCES * usart)
{
    switch (control & ARM_USART_CONTROL_Msk) {
    case ARM_USART_CONTROL_TX:
        if (arg != 0) {
#ifdef USART0
            if (usart->device == USART0) {
                NVIC_EnableIRQ(USART0_TX_IRQn);
            }
#endif
#ifdef USART1
            if (usart->device == USART1) {
                NVIC_EnableIRQ(USART1_TX_IRQn);
            }
#endif
#ifdef USART2
            if (usart->device == USART2) {
                NVIC_EnableIRQ(USART2_TX_IRQn);
            }
#endif
#ifdef USART3
            if (usart->device == USART3) {
                NVIC_EnableIRQ(USART3_TX_IRQn);
            }
#endif

            USART_IntEnable(usart->device, USART_IEN_TXC);
        } else {
            USART_IntDisable(usart->device, USART_IEN_TXC);
        }

        return ARM_DRIVER_OK;

    case ARM_USART_CONTROL_RX:
        if (arg != 0) {
#ifdef USART0
            if (usart->device == USART0) {
                NVIC_EnableIRQ(USART0_RX_IRQn);
            }
#endif
#ifdef USART1
            if (usart->device == USART1) {
                NVIC_EnableIRQ(USART1_RX_IRQn);
            }
#endif
#ifdef USART2
            if (usart->device == USART2) {
                NVIC_EnableIRQ(USART2_RX_IRQn);
            }
#endif
#ifdef USART3
            if (usart->device == USART3) {
                NVIC_EnableIRQ(USART3_RX_IRQn);
            }
#endif

            USART_IntEnable(usart->device, USART_IEN_RXDATAV);
        } else {
            USART_IntDisable(usart->device, USART_IEN_RXDATAV);
        }

        return ARM_DRIVER_OK;

    case ARM_USART_MODE_ASYNCHRONOUS:
        usart->usart_cfg.baudrate = arg;
        break;
    default:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (control & ARM_USART_DATA_BITS_Msk) {
    case ARM_USART_DATA_BITS_5:
    case ARM_USART_DATA_BITS_6:
    case ARM_USART_DATA_BITS_7:
        return ARM_DRIVER_ERROR_PARAMETER;
    case ARM_USART_DATA_BITS_8:
        usart->usart_cfg.databits = usartDatabits8;
        break;
    case ARM_USART_DATA_BITS_9:
        usart->usart_cfg.databits = usartDatabits9;
        break;
    default:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (control & ARM_USART_PARITY_Msk) {
    case ARM_USART_PARITY_NONE:
        usart->usart_cfg.parity = usartNoParity;
        break;
    case ARM_USART_PARITY_ODD:
        usart->usart_cfg.parity = usartOddParity;
        break;
    case ARM_USART_PARITY_EVEN:
        usart->usart_cfg.parity = usartEvenParity;
        break;
    default:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (control & ARM_USART_STOP_BITS_Msk) {
    case ARM_USART_STOP_BITS_0_5:
        usart->usart_cfg.stopbits = usartStopbits0p5;
        break;
    case ARM_USART_STOP_BITS_1:
        usart->usart_cfg.stopbits = usartStopbits1;
        break;
    case ARM_USART_STOP_BITS_1_5:
        usart->usart_cfg.stopbits = usartStopbits1p5;
        break;
    case ARM_USART_STOP_BITS_2:
        usart->usart_cfg.stopbits = usartStopbits2;
        break;
    default:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (control & ARM_USART_FLOW_CONTROL_Msk) {
    case ARM_USART_FLOW_CONTROL_NONE:
#if (_SILICON_LABS_32B_SERIES > 0)
        usart->usart_cfg.hwFlowControl = usartHwFlowControlNone;
        break;
#else
        break;
#endif
    case ARM_USART_FLOW_CONTROL_RTS:
#if (_SILICON_LABS_32B_SERIES > 0)
        usart->usart_cfg.hwFlowControl = usartHwFlowControlRts;
        break;
#else
        return ARM_DRIVER_ERROR_PARAMETER;
#endif
    case ARM_USART_FLOW_CONTROL_CTS:
#if (_SILICON_LABS_32B_SERIES > 0)
        usart->usart_cfg.hwFlowControl = usartHwFlowControlCts;
        break;
#else
        return ARM_DRIVER_ERROR_PARAMETER;
#endif
    case ARM_USART_FLOW_CONTROL_RTS_CTS:
#if (_SILICON_LABS_32B_SERIES > 0)
        usart->usart_cfg.hwFlowControl = usartHwFlowControlCtsAndRts;
        break;
#else
        return ARM_DRIVER_ERROR_PARAMETER;
#endif
    default:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

