mariusmm/CMSIS_Drivers/EFM32/CMSIS_Driver/Driver_USART.c
    USART_InitAsync(usart->device, &usart->usart_cfg);

    ((USART_TypeDef *) usart->device)->ROUTE = USART_ROUTE_RXPEN | USART_ROUTE_TXPEN | usart->LOCATION;

    return ARM_DRIVER_OK;
}

static int32_t EFM32_LEUART_Control(uint32_t control, uint32_t arg, EFM32_USART_RESOURCES const *usart)
{
    LEUART_Init_TypeDef leuart_cfg = LEUART_INIT_DEFAULT;

    switch (control & ARM_USART_CONTROL_Msk) {

    case ARM_USART_CONTROL_TX:
        if (arg != 0) {
#ifdef LEUART0
            if (usart->device == LEUART0) {
                NVIC_EnableIRQ(LEUART0_IRQn);
            }
#endif
#ifdef LEUART1
            if (usart->device == LEUART1) {
                NVIC_EnableIRQ(LEUART1_IRQn);
            }
#endif

            LEUART_IntEnable(usart->device, LEUART_IEN_TXC);
        } else {
            LEUART_IntDisable(usart->device, LEUART_IEN_TXC);
        }

        return ARM_DRIVER_OK;

    case ARM_USART_CONTROL_RX:
        if (arg != 0) {
#ifdef LEUART0
            if (usart->device == LEUART0) {
                NVIC_EnableIRQ(LEUART0_IRQn);
            }
#endif
#ifdef LEUART1
            if (usart->device == LEUART1) {
                NVIC_EnableIRQ(LEUART1_IRQn);
            }
#endif

            LEUART_IntEnable(usart->device, LEUART_IEN_RXDATAV);
        } else {
            LEUART_IntDisable(usart->device, LEUART_IEN_RXDATAV);
        }

        return ARM_DRIVER_OK;

    case ARM_USART_MODE_ASYNCHRONOUS:
        leuart_cfg.baudrate = arg;
        break;
    default:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (control & ARM_USART_DATA_BITS_Msk) {
    case ARM_USART_DATA_BITS_5:
    case ARM_USART_DATA_BITS_6:
    case ARM_USART_DATA_BITS_7:
        return ARM_DRIVER_ERROR_PARAMETER;
    case ARM_USART_DATA_BITS_8:
        leuart_cfg.databits = leuartDatabits8;
        break;
    case ARM_USART_DATA_BITS_9:
        leuart_cfg.databits = leuartDatabits9;
        break;
    default:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (control & ARM_USART_PARITY_Msk) {
    case ARM_USART_PARITY_NONE:
        leuart_cfg.parity = leuartNoParity;
        break;
    case ARM_USART_PARITY_ODD:
        leuart_cfg.parity = leuartOddParity;
        break;
    case ARM_USART_PARITY_EVEN:
        leuart_cfg.parity = leuartEvenParity;
        break;
    default:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (control & ARM_USART_STOP_BITS_Msk) {
    case ARM_USART_STOP_BITS_0_5:
        return ARM_DRIVER_ERROR_PARAMETER;
        break;
    case ARM_USART_STOP_BITS_1:
        leuart_cfg.stopbits = leuartStopbits1;
        break;
    case ARM_USART_STOP_BITS_1_5:
        return ARM_DRIVER_ERROR_PARAMETER;
        break;
    case ARM_USART_STOP_BITS_2:
        leuart_cfg.stopbits = leuartStopbits2;
        break;
    default:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (control & ARM_USART_FLOW_CONTROL_Msk) {
    case ARM_USART_FLOW_CONTROL_NONE:
        break;
    case ARM_USART_FLOW_CONTROL_RTS:
    case ARM_USART_FLOW_CONTROL_CTS:
    case ARM_USART_FLOW_CONTROL_RTS_CTS:
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    LEUART_Init(usart->device, &leuart_cfg);
    ((LEUART_TypeDef *) usart->device)->ROUTE = LEUART_ROUTE_RXPEN | LEUART_ROUTE_TXPEN | usart->LOCATION;

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS EFM32_USART_GetStatus(EFM32_USART_RESOURCES const *usart)
{
    return usart->status;
}

static ARM_USART_STATUS EFM32_LEUART_GetStatus(EFM32_USART_RESOURCES const *usart)
{
    return usart->status;
}

static int32_t EFM32_USART_SetModemControl(ARM_USART_MODEM_CONTROL control, EFM32_USART_RESOURCES const *usart)
{
    return 0;
}

static int32_t EFM32_LEUART_SetModemControl(ARM_USART_MODEM_CONTROL control, EFM32_USART_RESOURCES const *usart)
{
    return 0;
}

static ARM_USART_MODEM_STATUS EFM32_USART_GetModemStatus(EFM32_USART_RESOURCES const *usart)
{
    return usart->modem_status;
}

static ARM_USART_MODEM_STATUS EFM32_LEUART_GetModemStatus(EFM32_USART_RESOURCES const *usart)
{
    return usart->modem_status;
}

void USART_TX_IRQHandler(EFM32_USART_RESOURCES * usart)
{
    uint32_t flags;

    flags = USART_IntGet(usart->device);
    USART_IntClear(usart->device, flags);

    if (flags & USART_IF_TXC) {
        usart->xfer.TxCnt++;
        /* Continue sending TX Buffer */
        if (usart->xfer.TxCnt < usart->xfer.TxNum) {
            char *aux = (char *)usart->xfer.TxBuf;
            USART_Tx(usart->device, aux[usart->xfer.TxCnt]);
        }
    }
}

void USART_RX_IRQHandler(EFM32_USART_RESOURCES * usart)
{
    uint32_t flags;
    uint32_t event = 0;

    flags = USART_IntGet(usart->device);
    USART_IntClear(usart->device, flags);

    if (flags & USART_IF_RXDATAV) {
        char recv = USART_Rx(usart->device);
        if (usart->xfer.RxCnt < usart->xfer.RxNum) {
            char *aux = (char *)usart->xfer.RxBuf;
            aux[usart->xfer.RxCnt] = recv;
            usart->xfer.RxCnt++;
        }

        if (usart->xfer.RxCnt == usart->xfer.RxNum) {
            event = ARM_USART_EVENT_RECEIVE_COMPLETE;
            usart->status.rx_busy = false;
            USART_IntDisable(usart->device, USART_IEN_RXDATAV); // Disable Rx
        }
    }

    if ((event != 0) && (usart->cb_event != NULL)) {
        usart->cb_event(event);
    }
}

void LEUART_TX_IRQHandler(EFM32_USART_RESOURCES * usart)
{
    uint32_t flags;

    flags = LEUART_IntGet(usart->device);
    LEUART_IntClear(usart->device, flags);

    if (flags & LEUART_IF_TXC) {
        usart->xfer.TxCnt++;
        /* Continue sending TX Buffer */
        if (usart->xfer.TxCnt < usart->xfer.TxNum) {
            char *aux = (char *)usart->xfer.TxBuf;
            LEUART_Tx(usart->device, aux[usart->xfer.TxCnt]);
        }
    }
}

void LEUART_RX_IRQHandler(EFM32_USART_RESOURCES * usart)
{
    uint32_t flags;
    uint32_t event = 0;

    flags = LEUART_IntGet(usart->device);
    LEUART_IntClear(usart->device, flags);

    if (flags & LEUART_IF_RXDATAV) {
        char recv = LEUART_Rx(usart->device);
        if (usart->xfer.RxCnt < usart->xfer.RxNum) {
            char *aux = (char *)usart->xfer.RxBuf;
            aux[usart->xfer.RxCnt] = recv;
            usart->xfer.RxCnt++;
        }

        if (usart->xfer.RxCnt == usart->xfer.RxNum) {
            event = ARM_USART_EVENT_RECEIVE_COMPLETE;
            usart->status.rx_busy = false;
            LEUART_IntDisable(usart->device, LEUART_IEN_RXDATAV);       // Disable Rx
        }
    }

    if ((event != 0) && (usart->cb_event != NULL)) {
        usart->cb_event(event);
    }
}

//
//   Functions
//
static ARM_DRIVER_VERSION ARM_GetVersion(void)
{
    return DriverVersion;
}

#ifdef USART0
static ARM_USART_CAPABILITIES USART0_GetCapabilities(void)
{
    return USART0_Resources.capabilities;
}

static int32_t USART0_Initialize(ARM_USART_SignalEvent_t cb_event)
{
    return EFM32_USART_Initialize(cb_event, &USART0_Resources);
}

static int32_t USART0_Uninitialize(void)
{
    return EFM32_USART_Uninitialize(&USART0_Resources);
}

