mariusmm/CMSIS_Drivers/EFM32/CMSIS_Driver/Driver_USART.c
static int32_t USART0_PowerControl(ARM_POWER_STATE state)
{
    return EFM32_USART_PowerControl(state, &USART0_Resources);
}

static int32_t USART0_Send(const void *data, uint32_t num)
{
    return EFM32_USART_Send(data, num, &USART0_Resources);
}

static int32_t USART0_Receive(void *data, uint32_t num)
{
    return EFM32_USART_Receive(data, num, &USART0_Resources);
}

static int32_t USART0_Transfer(const void *data_out, void *data_in, uint32_t num)
{
    return EFM32_USART_Transfer(data_out, data_in, num, &USART0_Resources);
}

static uint32_t USART0_GetTxCount(void)
{
    return EFM32_USART_GetTxCount(&USART0_Resources);
}

static uint32_t USART0_GetRxCount(void)
{
    return EFM32_USART_GetRxCount(&USART0_Resources);
}

static int32_t USART0_Control(uint32_t control, uint32_t arg)
{
    return EFM32_USART_Control(control, arg, &USART0_Resources);
}

static ARM_USART_STATUS USART0_GetStatus(void)
{
    return EFM32_USART_GetStatus(&USART0_Resources);
}

static int32_t USART0_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    return EFM32_USART_SetModemControl(control, &USART0_Resources);
}

static ARM_USART_MODEM_STATUS USART0_GetModemStatus(void)
{
    return EFM32_USART_GetModemStatus(&USART0_Resources);
}

void USART0_TX_IRQHandler(void)
{
    USART_TX_IRQHandler(&USART0_Resources);
}

void USART0_RX_IRQHandler(void)
{
    USART_RX_IRQHandler(&USART0_Resources);
}
#endif

// USART1
#ifdef USART1
static ARM_USART_CAPABILITIES USART1_GetCapabilities(void)
{
    return USART1_Resources.capabilities;
}

static int32_t USART1_Initialize(ARM_USART_SignalEvent_t cb_event)
{
    return EFM32_USART_Initialize(cb_event, &USART1_Resources);
}

static int32_t USART1_Uninitialize(void)
{
    return EFM32_USART_Uninitialize(&USART1_Resources);
}

static int32_t USART1_PowerControl(ARM_POWER_STATE state)
{
    return EFM32_USART_PowerControl(state, &USART1_Resources);
}

static int32_t USART1_Send(const void *data, uint32_t num)
{
    return EFM32_USART_Send(data, num, &USART1_Resources);
}

static int32_t USART1_Receive(void *data, uint32_t num)
{
    return EFM32_USART_Receive(data, num, &USART1_Resources);
}

static int32_t USART1_Transfer(const void *data_out, void *data_in, uint32_t num)
{
    return EFM32_USART_Transfer(data_out, data_in, num, &USART1_Resources);
}

static uint32_t USART1_GetTxCount(void)
{
    return EFM32_USART_GetTxCount(&USART1_Resources);
}

static uint32_t USART1_GetRxCount(void)
{
    return EFM32_USART_GetRxCount(&USART1_Resources);
}

static int32_t USART1_Control(uint32_t control, uint32_t arg)
{
    return EFM32_USART_Control(control, arg, &USART1_Resources);
}

static ARM_USART_STATUS USART1_GetStatus(void)
{
    return EFM32_USART_GetStatus(&USART1_Resources);
}

static int32_t USART1_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    return EFM32_USART_SetModemControl(control, &USART1_Resources);
}

static ARM_USART_MODEM_STATUS USART1_GetModemStatus(void)
{
    return EFM32_USART_GetModemStatus(&USART1_Resources);
}

void USART1_TX_IRQHandler(void)
{
    USART_TX_IRQHandler(&USART1_Resources);
}

void USART1_RX_IRQHandler(void)
{
    USART_RX_IRQHandler(&USART1_Resources);
}
#endif

#ifdef USART2
static ARM_USART_CAPABILITIES USART2_GetCapabilities(void)
{
    return USART2_Resources.capabilities;
}

static int32_t USART2_Initialize(ARM_USART_SignalEvent_t cb_event)
{
    return EFM32_USART_Initialize(cb_event, &USART2_Resources);
}

static int32_t USART2_Uninitialize(void)
{
    return EFM32_USART_Uninitialize(&USART2_Resources);
}

static int32_t USART2_PowerControl(ARM_POWER_STATE state)
{
    return EFM32_USART_PowerControl(state, &USART2_Resources);
}

static int32_t USART2_Send(const void *data, uint32_t num)
{
    return EFM32_USART_Send(data, num, &USART2_Resources);
}

static int32_t USART2_Receive(void *data, uint32_t num)
{
    return EFM32_USART_Receive(data, num, &USART2_Resources);
}

static int32_t USART2_Transfer(const void *data_out, void *data_in, uint32_t num)
{
    return EFM32_USART_Transfer(data_out, data_in, num, &USART2_Resources);
}

static uint32_t USART2_GetTxCount(void)
{
    return EFM32_USART_GetTxCount(&USART2_Resources);
}

static uint32_t USART2_GetRxCount(void)
{
    return EFM32_USART_GetRxCount(&USART2_Resources);
}

static int32_t USART2_Control(uint32_t control, uint32_t arg)
{
    return EFM32_USART_Control(control, arg, &USART2_Resources);
}

static ARM_USART_STATUS USART2_GetStatus(void)
{
    return EFM32_USART_GetStatus(&USART2_Resources);
}

static int32_t USART2_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    return EFM32_USART_SetModemControl(control, &USART2_Resources);
}

static ARM_USART_MODEM_STATUS USART2_GetModemStatus(void)
{
    return EFM32_USART_GetModemStatus(&USART2_Resources);
}

void USART2_TX_IRQHandler(void)
{
    USART_TX_IRQHandler(&USART2_Resources);
}

void USART2_RX_IRQHandler(void)
{
    USART_RX_IRQHandler(&USART2_Resources);
}
#endif

#ifdef USART3
static ARM_USART_CAPABILITIES USART3_GetCapabilities(void)
{
    return USART3_Resources.capabilities;
}

static int32_t USART3_Initialize(ARM_USART_SignalEvent_t cb_event)
{
    return EFM32_USART_Initialize(cb_event, &USART3_Resources);
}

static int32_t USART3_Uninitialize(void)
{
    return EFM32_USART_Uninitialize(&USART3_Resources);
}

static int32_t USART3_PowerControl(ARM_POWER_STATE state)
{
    return EFM32_USART_PowerControl(state, &USART3_Resources);
}

static int32_t USART3_Send(const void *data, uint32_t num)
{
    return EFM32_USART_Send(data, num, &USART3_Resources);
}

static int32_t USART3_Receive(void *data, uint32_t num)
{
    return EFM32_USART_Receive(data, num, &USART3_Resources);
}

static int32_t USART3_Transfer(const void *data_out, void *data_in, uint32_t num)
{
    return EFM32_USART_Transfer(data_out, data_in, num, &USART3_Resources);
}

static uint32_t USART3_GetTxCount(void)
{
    return EFM32_USART_GetTxCount(&USART3_Resources);
}

static uint32_t USART3_GetRxCount(void)
{
    return EFM32_USART_GetRxCount(&USART3_Resources);
}

static int32_t USART3_Control(uint32_t control, uint32_t arg)
{
    return EFM32_USART_Control(control, arg, &USART3_Resources);
}

static ARM_USART_STATUS USART3_GetStatus(void)
{
    return EFM32_USART_GetStatus(&USART3_Resources);
}

