mariusmm/CMSIS_Drivers/EFM32/CMSIS_Driver/Driver_USART.c
static int32_t USART3_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    return EFM32_USART_SetModemControl(control, &USART3_Resources);
}

static ARM_USART_MODEM_STATUS USART3_GetModemStatus(void)
{
    return EFM32_USART_GetModemStatus(&USART3_Resources);
}

void USART3_TX_IRQHandler(void)
{
    USART_TX_IRQHandler(&USART3_Resources);
}

void USART3_RX_IRQHandler(void)
{
    USART_RX_IRQHandler(&USART3_Resources);
}
#endif

// LEUART0
#ifdef LEUART0
static ARM_USART_CAPABILITIES LEUART0_GetCapabilities(void)
{
    return LEUART0_Resources.capabilities;
}

static int32_t LEUART0_Initialize(ARM_USART_SignalEvent_t cb_event)
{
    return EFM32_LEUART_Initialize(cb_event, &LEUART0_Resources);
}

static int32_t LEUART0_Uninitialize(void)
{
    return EFM32_LEUART_Uninitialize(&LEUART0_Resources);
}

static int32_t LEUART0_PowerControl(ARM_POWER_STATE state)
{
    return EFM32_LEUART_PowerControl(state, &LEUART0_Resources);
}

static int32_t LEUART0_Send(const void *data, uint32_t num)
{
    return EFM32_LEUART_Send(data, num, &LEUART0_Resources);
}

static int32_t LEUART0_Receive(void *data, uint32_t num)
{
    return EFM32_LEUART_Receive(data, num, &LEUART0_Resources);
}

static int32_t LEUART0_Transfer(const void *data_out, void *data_in, uint32_t num)
{
    return EFM32_LEUART_Transfer(data_out, data_in, num, &LEUART0_Resources);
}

static uint32_t LEUART0_GetTxCount(void)
{
    return EFM32_LEUART_GetTxCount(&LEUART0_Resources);
}

static uint32_t LEUART0_GetRxCount(void)
{
    return EFM32_LEUART_GetRxCount(&LEUART0_Resources);
}

static int32_t LEUART0_Control(uint32_t control, uint32_t arg)
{
    return EFM32_LEUART_Control(control, arg, &LEUART0_Resources);
}

static ARM_USART_STATUS LEUART0_GetStatus(void)
{
    return EFM32_LEUART_GetStatus(&LEUART0_Resources);
}

static int32_t LEUART0_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    return EFM32_LEUART_SetModemControl(control, &LEUART0_Resources);
}

static ARM_USART_MODEM_STATUS LEUART0_GetModemStatus(void)
{
    return EFM32_LEUART_GetModemStatus(&LEUART0_Resources);
}

void LEUART0_IRQHandler(void)
{
    uint32_t flags;
    flags = LEUART_IntGet(LEUART0);

    if (flags & LEUART_IF_TXC) {
        LEUART_TX_IRQHandler(&LEUART0_Resources);
    } else if (flags & LEUART_IF_RXDATAV) {
        LEUART_RX_IRQHandler(&LEUART0_Resources);
    }
}
#endif

#ifdef LEUART1
static ARM_USART_CAPABILITIES LEUART1_GetCapabilities(void)
{
    return LEUART1_Resources.capabilities;
}

static int32_t LEUART1_Initialize(ARM_USART_SignalEvent_t cb_event)
{
    return EFM32_LEUART_Initialize(cb_event, &LEUART1_Resources);
}

static int32_t LEUART1_Uninitialize(void)
{
    return EFM32_LEUART_Uninitialize(&LEUART1_Resources);
}

static int32_t LEUART1_PowerControl(ARM_POWER_STATE state)
{
    return EFM32_LEUART_PowerControl(state, &LEUART1_Resources);
}

static int32_t LEUART1_Send(const void *data, uint32_t num)
{
    return EFM32_LEUART_Send(data, num, &LEUART1_Resources);
}

static int32_t LEUART1_Receive(void *data, uint32_t num)
{
    return EFM32_LEUART_Receive(data, num, &LEUART1_Resources);
}

static int32_t LEUART1_Transfer(const void *data_out, void *data_in, uint32_t num)
{
    return EFM32_LEUART_Transfer(data_out, data_in, num, &LEUART1_Resources);
}

static uint32_t LEUART1_GetTxCount(void)
{
    return EFM32_LEUART_GetTxCount(&LEUART1_Resources);
}

static uint32_t LEUART1_GetRxCount(void)
{
    return EFM32_LEUART_GetRxCount(&LEUART1_Resources);
}

static int32_t LEUART1_Control(uint32_t control, uint32_t arg)
{
    return EFM32_LEUART_Control(control, arg, &LEUART1_Resources);
}

static ARM_USART_STATUS LEUART1_GetStatus(void)
{
    return EFM32_LEUART_GetStatus(&LEUART1_Resources);
}

static int32_t LEUART1_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    return EFM32_LEUART_SetModemControl(control, &LEUART1_Resources);
}

static ARM_USART_MODEM_STATUS LEUART1_GetModemStatus(void)
{
    return EFM32_LEUART_GetModemStatus(&LEUART1_Resources);
}

void LEUART1_IRQHandler(void)
{
    uint32_t flags;
    flags = LEUART_IntGet(LEUART1);

    if (flags & LEUART_IF_TXC) {
        LEUART_TX_IRQHandler(&LEUART1_Resources);
    } else if (flags & LEUART_IF_RXDATAV) {
        LEUART_RX_IRQHandler(&LEUART1_Resources);
    }
}
#endif

#ifdef USART0
ARM_DRIVER_USART Driver_USART0 = {
    ARM_GetVersion,
    USART0_GetCapabilities,
    USART0_Initialize,
    USART0_Uninitialize,
    USART0_PowerControl,
    USART0_Send,
    USART0_Receive,
    USART0_Transfer,
    USART0_GetTxCount,
    USART0_GetRxCount,
    USART0_Control,
    USART0_GetStatus,
    USART0_SetModemControl,
    USART0_GetModemStatus
};
#endif
#ifdef USART1
ARM_DRIVER_USART Driver_USART1 = {
    ARM_GetVersion,
    USART1_GetCapabilities,
    USART1_Initialize,
    USART1_Uninitialize,
    USART1_PowerControl,
    USART1_Send,
    USART1_Receive,
    USART1_Transfer,
    USART1_GetTxCount,
    USART1_GetRxCount,
    USART1_Control,
    USART1_GetStatus,
    USART1_SetModemControl,
    USART1_GetModemStatus
};
#endif
#ifdef USART2
ARM_DRIVER_USART Driver_USART2 = {
    ARM_GetVersion,
    USART2_GetCapabilities,
    USART2_Initialize,
    USART2_Uninitialize,
    USART2_PowerControl,
    USART2_Send,
    USART2_Receive,
    USART2_Transfer,
    USART2_GetTxCount,
    USART2_GetRxCount,
    USART2_Control,
    USART2_GetStatus,
    USART2_SetModemControl,
    USART2_GetModemStatus
};
#endif
#ifdef USART3
ARM_DRIVER_USART Driver_USART3 = {
    ARM_GetVersion,
    USART3_GetCapabilities,
    USART3_Initialize,
    USART3_Uninitialize,
    USART3_PowerControl,
    USART3_Send,
    USART3_Receive,
    USART3_Transfer,
    USART3_GetTxCount,
    USART3_GetRxCount,
    USART3_Control,
    USART3_GetStatus,
    USART3_SetModemControl,
    USART3_GetModemStatus
};
#endif
#ifdef LEUART0
ARM_DRIVER_USART Driver_LEUART0 = {
    ARM_GetVersion,
    LEUART0_GetCapabilities,
    LEUART0_Initialize,
    LEUART0_Uninitialize,
    LEUART0_PowerControl,
    LEUART0_Send,
    LEUART0_Receive,
    LEUART0_Transfer,
    LEUART0_GetTxCount,
    LEUART0_GetRxCount,
    LEUART0_Control,
    LEUART0_GetStatus,
    LEUART0_SetModemControl,
    LEUART0_GetModemStatus,
};
#endif
#ifdef LEUART1
ARM_DRIVER_USART Driver_LEUART1 = {
    ARM_GetVersion,
    LEUART1_GetCapabilities,
    LEUART1_Initialize,
    LEUART1_Uninitialize,
    LEUART1_PowerControl,
    LEUART1_Send,
    LEUART1_Receive,
    LEUART1_Transfer,
    LEUART1_GetTxCount,
    LEUART1_GetRxCount,
    LEUART1_Control,
    LEUART1_GetStatus,
    LEUART1_SetModemControl,
    LEUART1_GetModemStatus,
};
#endif
